<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"5df14bcb44fcbd373228a4e63a89d9d98b9f8cedd24740d7d5268257875681d7","plan_job_ref":"Job Test plan target and replace #391 at https://github.com/dflook/terraform-github-actions/actions/runs/7314189920","plan_hash":"8ce08e67077ce9f589ee2ec373d95e1de3fc1ae0e4be2b675cbadbca9e330f54","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
!~  count   = "xIODu8fdeu" -> (known after apply)
!~  foreach = "dlfHaARm2h" -> (known after apply)
```
</details>

:memo: Plan generated in [Test plan target and replace #391](https://github.com/dflook/terraform-github-actions/actions/runs/7314189920)